#include <stdio.h>
#include <math.h>

// double позволяет хранить дробные числа 
double R, a;
double r,h,l;
double V,S;

int main()
{
    //вводим исходные данные
    printf("Введите радиус шара: ");

    //считываем их и записываем в R
    scanf("%lf", &R);

    //вводим исходные данные
    printf("Введите угол а при вершине в осевом сечении конуса: ");

    //считываем данные и записываем в a
    scanf("%lf", &a);

    // радиус основания конуса
    r = R*sin(a * 3.14/180);

    // высота конуса
    h = R*(1+cos(a * 3.14/360));

    // образующая конуса
    l = 2*R*cos(a*3.14/360);

    // объем конуса
    V = 3.14*r*r*h/3;

    // полная поверхность конуса
    S = 3.14*r*(r+l);

    //выводим все полученные значения
    printf("\nРезультаты:\n");
    printf("Радиус основания r = %.2f\n", r);
    printf("Высота конуса h = %.2f\n", h);
    printf("Образующая l = %.2f\n", l);
    printf("Объем конуса V = %.2f\n", V);
    printf("Полная поверхность S = %.2f\n", S);

    //завершаем программу
    return 0;

}