#include <stdio.h>

/**
 * @brief вычисляет значение функции по заданной формуле
 * @param F сила тяги
 * @param A работа
 * @param s пройденный путь
 * @return рассчитанное значение
 */

 double F,A,s;

/**
 * @brief точка входа в программу
 * @brief Считывает с клавиатуры занчение
 * @return 0, если программа выполнена корректно, иначе не 0
 */

int main()
{

    printf("Введите силу тяги F: ");
    scanf("%lf", &F);

    printf("Введите работу A: ");
    scanf("%lf", &A);
    

    s = (A * 1000)/F;
    printf("Пройденный путь: %.2f\n", s);

    return 0;
}
